### pandas - DataFrame
- 2차원 행렬(표), Series를 묶어낸 자료형

In [1]:
import numpy as np
import pandas as pd

---

DataFrame 생성

In [2]:
# dictionary-list 활용
data = {
    'one': [1, 2, 3, 4, 5],
    'two': ['가', '나', '다' , '라' , '마'],
    'three': [1.23, 2.34, 3.45, 4.56, 5.67],
    'four': True
}
df = pd.DataFrame(data)
df

   one two  three  four
0    1   가   1.23  True
1    2   나   2.34  True
2    3   다   3.45  True
3    4   라   4.56  True
4    5   마   5.67  True

In [8]:
# list-dictionary 활용
data = [
    {'a': 1, 'b': 2, 'c': 3},
    {'b': 5, 'c': 6},
    {'a': 7, 'b': 8, 'c': 9}
]

df = pd.DataFrame(data)


df.index = ['토끼', '판다', '코알라']
print(df.index)

df.columns = ['협동심', '성실도', '인내심']

print(df.columns)
df

Index(['토끼', '판다', '코알라'], dtype='object')
Index(['협동심', '성실도', '인내심'], dtype='object')

     협동심  성실도  인내심
토끼   1.0    2    3
판다   NaN    5    6
코알라  7.0    8    9

In [18]:
# 2차원 ndarray 활용

arr = np.random.randn(2, 3)
df = pd.DataFrame(arr, index=['ㄱ', 'ㄴ'], columns=['A', 'B', 'C'])

# df.index = ['ㄱ', 'ㄴ']
# df.columns = ['A', 'B', 'C']
df

          A         B         C
ㄱ  0.094993  0.395756  0.385268
ㄴ -1.932902 -1.781330 -0.953815

In [21]:
data = {
    '이름': ['토끼', '판다', '유니콘'],
    '위치': ['독산', '종로', '천호'],
    '성별': ['F', 'F', 'M']
}
df = pd.DataFrame(data)
# df = pd.DataFrame(data, index=['rabbit', 'panda', 'unicorn'])
df

    이름  위치 성별
0   토끼  독산  F
1   판다  종로  F
2  유니콘  천호  M

In [22]:
# 전치행렬 (행과 열을 바꿈)
df.T

     0   1    2
이름  토끼  판다  유니콘
위치  독산  종로   천호
성별   F   F    M

---

##### DataFrame 속성성

In [24]:
print(df.index)
print(df.columns)
print(df.values, type(df.values))

RangeIndex(start=0, stop=3, step=1)
Index(['이름', '위치', '성별'], dtype='object')
[['토끼' '독산' 'F']
 ['판다' '종로' 'F']
 ['유니콘' '천호' 'M']] <class 'numpy.ndarray'>

In [25]:
df.T

     0   1    2
이름  토끼  판다  유니콘
위치  독산  종로   천호
성별   F   F    M

In [26]:
print(df.shape)     # 형태
print(df.size)      # 요소 개수
print(df.ndim)      # 깊이
print(df.dtypes)    # 요소의 자료형

(3, 3)
9
2
이름    object
위치    object
성별    object
dtype: object

---

##### DataFrame 메서드

In [53]:
bank_client_df = pd.DataFrame({
    'Client ID': [1, 2, 3, 4],
    'Client Name': ['Aly', 'Steve', 'Nicole', 'Morris'],
    'Net worth [$]': [35000, 3000, 100000, 2000],
    'Years with bank': [4, 7, 10, 15]
})
bank_client_df

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
1          2       Steve           3000                7
2          3      Nicole         100000               10
3          4      Morris           2000               15

In [28]:
print(bank_client_df.head(2))
print(bank_client_df.tail(2))

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
1          2       Steve           3000                7
   Client ID Client Name  Net worth [$]  Years with bank
2          3      Nicole         100000               10
3          4      Morris           2000               15

In [29]:
bank_client_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Client ID        4 non-null      int64
 1   Client Name      4 non-null      object
 2   Net worth [$]    4 non-null      int64
 3   Years with bank  4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes

In [30]:
bank_client_df.describe()

       Client ID  Net worth [$]  Years with bank
count   4.000000       4.000000         4.000000
mean    2.500000   35000.000000         9.000000
std     1.290994   45963.753836         4.690416
min     1.000000    2000.000000         4.000000
25%     1.750000    2750.000000         6.250000
50%     2.500000   19000.000000         8.500000
75%     3.250000   51250.000000        11.250000
max     4.000000  100000.000000        15.000000

In [31]:
bank_client_df

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
1          2       Steve           3000                7
2          3      Nicole         100000               10
3          4      Morris           2000               15

In [ ]:
# indexing / slicing
# iloc 인덱스 - 행/열 순서로 조회
# loc 라벨 - 행/열 순서로 조회
print(bank_client_df.iloc[0])
print(type(bank_client_df.iloc[0]))
print(type(bank_client_df.iloc[0].index))
print(type(bank_client_df.iloc[0].name))

Client ID              1
Client Name          Aly
Net worth [$]      35000
Years with bank        4
Name: 0, dtype: object
<class 'pandas.core.series.Series'>
<class 'pandas.core.indexes.base.Index'>
<class 'int'>

In [36]:
bank_client_df.iloc[:2], type(bank_client_df.iloc[:2])

(   Client ID Client Name  Net worth [$]  Years with bank
 0          1         Aly          35000                4
 1          2       Steve           3000                7,
 pandas.core.frame.DataFrame)

In [38]:
bank_client_df.iloc[[0, 2]], type(bank_client_df.iloc[[0, 2]])

(   Client ID Client Name  Net worth [$]  Years with bank
 0          1         Aly          35000                4
 2          3      Nicole         100000               10,
 pandas.core.frame.DataFrame)

In [ ]:
# fancy indexing을 통한 조회는 결과가 1개여도 DataFrame 타입으로 반환
# -> (인덱싱) Series를 반환한다는 것은 차원을 축소(제거)하는 것
# -> DataFrame을 반환한다는 것은 차원을 유지하는 것
print(bank_client_df.iloc[[2]].shape)
print(bank_client_df.iloc[2].shape)
bank_client_df.iloc[[2]], type(bank_client_df.iloc[[2]])

(1, 4)
(4,)

(   Client ID Client Name  Net worth [$]  Years with bank
 2          3      Nicole         100000               10,
 pandas.core.frame.DataFrame)

In [42]:
# 2차원 indexing/slicing
bank_client_df.iloc[0, 1]

'Aly'

In [48]:
bank_client_df.iloc[:2, 1], type(bank_client_df.iloc[:2, 1])

(0      Aly
 1    Steve
 Name: Client Name, dtype: object,
 pandas.core.series.Series)

In [49]:
bank_client_df.iloc[:2, 2:], type(bank_client_df.iloc[:2, 2:])

(   Net worth [$]  Years with bank
 0          35000                4
 1           3000                7,
 pandas.core.frame.DataFrame)

In [56]:
print(bank_client_df)
bank_client_df.index = ['client1', 'client2', 'client3', 'client4']

         Client ID Client Name  Net worth [$]  Years with bank
client1          1         Aly          35000                4
client2          2       Steve           3000                7
client3          3      Nicole         100000               10
client4          4      Morris           2000               15

In [57]:
bank_client_df.loc['client3']

Client ID               3
Client Name        Nicole
Net worth [$]      100000
Years with bank        10
Name: client3, dtype: object

In [60]:
bank_client_df.iloc[1:3]

         Client ID Client Name  Net worth [$]  Years with bank
client2          2       Steve           3000                7
client3          3      Nicole         100000               10

In [62]:
bank_client_df.loc['client2':'client4':2]

         Client ID Client Name  Net worth [$]  Years with bank
client2          2       Steve           3000                7
client4          4      Morris           2000               15

In [ ]:
bank_client_df.loc['client2':'client4':2, 'Client Name'], type(bank_client_df.loc['client2':'client4':2, 'Client Name'])

(client2     Steve
 client4    Morris
 Name: Client Name, dtype: object,
 pandas.core.series.Series)

In [67]:
bank_client_df.loc['client2':'client4':2, 'Client Name':'Net worth [$]'], type(bank_client_df.loc['client2':'client4':2, 'Client Name':'Net worth [$]'])

(        Client Name  Net worth [$]
 client2       Steve           3000
 client4      Morris           2000,
 pandas.core.frame.DataFrame)

In [68]:
bank_client_df.loc['client2':'client4':2, ['Client Name', 'Years with bank']]

        Client Name  Years with bank
client2       Steve                7
client4      Morris               15

In [69]:
# 이름이 Steve인 고객 정보 출력
bank_client_df.loc[bank_client_df['Client Name'] == 'Steve']

         Client ID Client Name  Net worth [$]  Years with bank
client2          2       Steve           3000                7

In [70]:
# Client Name 만 출력
bank_client_df['Client Name']

client1       Aly
client2     Steve
client3    Nicole
client4    Morris
Name: Client Name, dtype: object

In [71]:
# Client Name과 Net worth [$] 출력
bank_client_df[['Client Name', 'Net worth [$]']]

        Client Name  Net worth [$]
client1         Aly          35000
client2       Steve           3000
client3      Nicole         100000
client4      Morris           2000

In [72]:
# filter
bank_client_df.filter(items=['Client Name', 'Net worth [$]'])

        Client Name  Net worth [$]
client1         Aly          35000
client2       Steve           3000
client3      Nicole         100000
client4      Morris           2000

In [73]:
bank_client_df.filter(like='$', axis=1)

         Net worth [$]
client1          35000
client2           3000
client3         100000
client4           2000

In [75]:
bank_client_df.filter(like='4', axis=0)

         Client ID Client Name  Net worth [$]  Years with bank
client4          4      Morris           2000               15

---

##### 행 추가 및 삭제

In [97]:
students = [
    {'name': '호랑이', 'midterm': 95, 'final': 85},
    {'name': '늑대', 'midterm': 93, 'final': 90},
    {'name': '양', 'midterm': 100, 'final': 10}
]
df = pd.DataFrame(students)
df

  name  midterm  final
0  호랑이       95     85
1   늑대       93     90
2    양      100     10

In [91]:
# 행 추가 1. loc 이용
df.loc[len(df)] = ['하마', 88, 72]
df

  name  midterm  final
0  호랑이       95     85
1   늑대       93     90
2    양      100     10
3   하마       88     72

In [92]:
# 행 추가 2. pd.concat() 이용 : DataFrame 병합
add_student_df = pd.DataFrame([['곰', 99, 24]], columns=['name', 'midterm', 'final'])
df = pd.concat([df, add_student_df], ignore_index=True)  # ignore_index : 인덱스를 새로 부여
df

  name  midterm  final
0  호랑이       95     85
1   늑대       93     90
2    양      100     10
3   하마       88     72
4    곰       99     24

In [ ]:
# 행 삭제 : drop index 이용

# df = df.drop(df.index[[0]])
df.drop(df.index[[0]], inplace=True)
df

  name  midterm  final
1   늑대       93     90
2    양      100     10

---

##### 컬럼 추가

In [99]:
df = pd.DataFrame({
    '이름': ['토끼', '판다', '유니콘'],
    '위치': ['독산', '종로', '천호'],
    '성별': ['F', 'F', 'M']
})

In [100]:
# 컬럼명 이용
df['취미'] = '인공지능 공부'
df

    이름  위치 성별       취미
0   토끼  독산  F  인공지능 공부
1   판다  종로  F  인공지능 공부
2  유니콘  천호  M  인공지능 공부

In [103]:
# 컬럼명과 np.where(조건, True일 때 값, False일 때 값) -> ndarray 이용
df['성별(한글)'] = np.where(df['성별'] == 'M', '남성', '여성')
df

    이름  위치 성별       취미 성별(한글)
0   토끼  독산  F  인공지능 공부     여성
1   판다  종로  F  인공지능 공부     여성
2  유니콘  천호  M  인공지능 공부     남성

In [2]:
df = pd.DataFrame({
    '이름': ['토끼', '판다', '유니콘'],
    '위치': ['독산', '종로', '천호'],
    '성별': ['F', 'F', 'M'],
    '키': [179, 165, 157],
    '체중': [50.1, 48.2, 51.3]
})

In [3]:
# 컬럼명과 기존 컬럼 연산 이용
df['BMI'] = df['체중'] / ((df['키'] * 0.01) ** 2)  # BMI = kg / m^2
df

    이름  위치 성별    키    체중        BMI
0   토끼  독산  F  179  50.1  15.636216
1   판다  종로  F  165  48.2  17.704316
2  유니콘  천호  M  157  51.3  20.812203

In [5]:
# apply()
def get_type(value):
    return '저체중' if value < 18 else '표준'

df['BMI type'] = df['BMI'].apply(get_type)
df

    이름  위치 성별    키    체중        BMI BMI type
0   토끼  독산  F  179  50.1  15.636216      저체중
1   판다  종로  F  165  48.2  17.704316      저체중
2  유니콘  천호  M  157  51.3  20.812203       표준

In [7]:
# 컬럼 삭제 : drop 이용
df.drop('BMI type', axis=1, inplace=True)
df

    이름  위치 성별    키    체중        BMI
0   토끼  독산  F  179  50.1  15.636216
1   판다  종로  F  165  48.2  17.704316
2  유니콘  천호  M  157  51.3  20.812203

---

##### 정렬

In [8]:
df = pd.read_csv('data/bank_client_information.csv')
df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [10]:
df.sort_values('Net Worth', ascending=False)

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [11]:
# 오래된 고객순으로 출력
df.sort_values('Years with Bank', ascending=False)

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [ ]:
# 순자산이 많고 오래된 고객순으로 출력
# 정렬 기준으로 n개의 컬럼을 사용할 수 있으며, 이때 ascending 속성 역시 짝을 맞추어 n개 전달
df.sort_values(['Net Worth', 'Years with Bank'], ascending=[False, False])

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1